# РёРјРїРѕСЂС‚РёСЂСѓРµРј Р±РёР±Р»РёРѕС‚РµРєРё
from flask import Flask, request
import logging

# Р±РёР±Р»РёРѕС‚РµРєР°, РєРѕС‚РѕСЂР°СЏ РЅР°Рј РїРѕРЅР°РґРѕР±РёС‚СЃСЏ РґР»СЏ СЂР°Р±РѕС‚С‹ СЃ JSON
import json

# СЃРѕР·РґР°РµРј РїСЂРёР»РѕР¶РµРЅРёРµ
# РјС‹ РїРµСЂРµРґР°РµРј __name__, РІ РЅРµРј СЃРѕРґРµСЂР¶РёС‚СЃСЏ РёРЅС„РѕСЂРјР°С†РёСЏ, РІ РєР°РєРѕРј РјРѕРґСѓР»Рµ РјС‹ РЅР°С…РѕРґРёРјСЃСЏ.
# Р’ РґР°РЅРЅРѕРј СЃР»СѓС‡Р°Рµ С‚Р°Рј СЃРѕРґРµСЂР¶РёС‚СЃСЏ '__main__', С‚Р°Рє РєР°Рє РјС‹ РѕР±СЂР°С‰Р°РµРјСЃСЏ Рє РїРµСЂРµРјРµРЅРЅРѕР№ РёР· Р·Р°РїСѓС‰РµРЅРЅРѕРіРѕ РјРѕРґСѓР»СЏ.
# РµСЃР»Рё Р±С‹ С‚Р°РєРѕРµ РѕР±СЂР°С‰РµРЅРёРµ, РЅР°РїСЂРёРјРµСЂ, РїСЂРѕРёР·РѕС€Р»Рѕ РІРЅСѓС‚СЂРё РјРѕРґСѓР»СЏ logging, С‚Рѕ РјС‹ Р±С‹ РїРѕР»СѓС‡РёР»Рё 'logging'
app = Flask(__name__)

# РЈСЃС‚Р°РЅР°РІР»РёРІР°РµРј СѓСЂРѕРІРµРЅСЊ Р»РѕРіРёСЂРѕРІР°РЅРёСЏ
logging.basicConfig(level=logging.INFO)

# РЎРѕР·РґР°РґРёРј СЃР»РѕРІР°СЂСЊ, С‡С‚РѕР±С‹ РґР»СЏ РєР°Р¶РґРѕР№ СЃРµСЃСЃРёРё РѕР±С‰РµРЅРёСЏ СЃ РЅР°РІС‹РєРѕРј С…СЂР°РЅРёР»РёСЃСЊ РїРѕРґСЃРєР°Р·РєРё, РєРѕС‚РѕСЂС‹Рµ РІРёРґРµР» РїРѕР»СЊР·РѕРІР°С‚РµР»СЊ.
# Р­С‚Рѕ РїРѕРјРѕР¶РµС‚ РЅР°Рј РЅРµРјРЅРѕРіРѕ СЂР°Р·РЅРѕРѕР±СЂР°Р·РёС‚СЊ РїРѕРґСЃРєР°Р·РєРё РѕС‚РІРµС‚РѕРІ (buttons РІ JSON РѕС‚РІРµС‚Р°).
# РљРѕРіРґР° РЅРѕРІС‹Р№ РїРѕР»СЊР·РѕРІР°С‚РµР»СЊ РЅР°РїРёС€РµС‚ РЅР°С€РµРјСѓ РЅР°РІС‹РєСѓ, С‚Рѕ РјС‹ СЃРѕС…СЂР°РЅРёРј РІ СЌС‚РѕС‚ СЃР»РѕРІР°СЂСЊ Р·Р°РїРёСЃСЊ С„РѕСЂРјР°С‚Р°
# sessionStorage[user_id] = { 'suggests': ["РќРµ С…РѕС‡Сѓ.", "РќРµ Р±СѓРґСѓ.", "РћС‚СЃС‚Р°РЅСЊ!" ] }
# РўР°РєР°СЏ Р·Р°РїРёСЃСЊ РіРѕРІРѕСЂРёС‚, С‡С‚Рѕ РјС‹ РїРѕРєР°Р·Р°Р»Рё РїРѕР»СЊР·РѕРІР°С‚РµР»СЋ СЌС‚Рё С‚СЂРё РїРѕРґСЃРєР°Р·РєРё. РљРѕРіРґР° РѕРЅ РѕС‚РєР°Р¶РµС‚СЃСЏ РєСѓРїРёС‚СЊ СЃР»РѕРЅР°,
# С‚Рѕ РјС‹ СѓР±РµСЂРµРј РѕРґРЅСѓ РїРѕРґСЃРєР°Р·РєСѓ. РљР°Рє Р±СѓРґС‚Рѕ С‡С‚Рѕ-С‚Рѕ РјРµРЅСЏРµС‚СЃСЏ :)
sessionStorage = {}


@app.route('/post', methods=['POST'])
# Р¤СѓРЅРєС†РёСЏ РїРѕР»СѓС‡Р°РµС‚ С‚РµР»Рѕ Р·Р°РїСЂРѕСЃР° Рё РІРѕР·РІСЂР°С‰Р°РµС‚ РѕС‚РІРµС‚.
# Р’РЅСѓС‚СЂРё С„СѓРЅРєС†РёРё РґРѕСЃС‚СѓРїРµРЅ request.json - СЌС‚Рѕ JSON, РєРѕС‚РѕСЂС‹Р№ РѕС‚РїСЂР°РІРёР»Р° РЅР°Рј РђР»РёСЃР° РІ Р·Р°РїСЂРѕСЃРµ POST
def main():
    logging.info('Request: %r', request.json)

    # РќР°С‡РёРЅР°РµРј С„РѕСЂРјРёСЂРѕРІР°С‚СЊ РѕС‚РІРµС‚, СЃРѕРіР»Р°СЃРЅРѕ РґРѕРєСѓРјРµРЅС‚Р°С†РёРё
    # РјС‹ СЃРѕР±РёСЂР°РµРј СЃР»РѕРІР°СЂСЊ, РєРѕС‚РѕСЂС‹Р№ РїРѕС‚РѕРј РїСЂРё РїРѕРјРѕС‰Рё Р±РёР±Р»РёРѕС‚РµРєРё json РїСЂРµРѕР±СЂР°Р·СѓРµРј РІ JSON Рё РѕС‚РґР°РґРёРј РђР»РёСЃРµ
    response = {
        'session': request.json['session'],
        'version': request.json['version'],
        'response': {
            'end_session': False
        }
    }

    # РћС‚РїСЂР°РІР»СЏРµРј request.json Рё response РІ С„СѓРЅРєС†РёСЋ handle_dialog. РћРЅР° СЃС„РѕСЂРјРёСЂСѓРµС‚ РѕСЃС‚Р°РІС€РёРµСЃСЏ РїРѕР»СЏ JSON, РєРѕС‚РѕСЂС‹Рµ РѕС‚РІРµС‡Р°СЋС‚
    # РЅРµРїРѕСЃСЂРµРґСЃС‚РІРµРЅРЅРѕ Р·Р° РІРµРґРµРЅРёРµ РґРёР°Р»РѕРіР°
    handle_dialog(request.json, response)

    logging.info('Response: %r', request.json)

    # РџСЂРµРѕР±СЂР°Р·РѕРІС‹РІР°РµРј РІ JSON Рё РІРѕР·РІСЂР°С‰Р°РµРј
    return json.dumps(response)


def handle_dialog(req, res):
    user_id = req['session']['user_id']

    if req['session']['new']:
        # Р­С‚Рѕ РЅРѕРІС‹Р№ РїРѕР»СЊР·РѕРІР°С‚РµР»СЊ.
        # РРЅРёС†РёР°Р»РёР·РёСЂСѓРµРј СЃРµСЃСЃРёСЋ Рё РїРѕРїСЂРёРІРµС‚СЃС‚РІСѓРµРј РµРіРѕ.
        # Р—Р°РїРёС€РµРј РїРѕРґСЃРєР°Р·РєРё, РєРѕС‚РѕСЂС‹Рµ РјС‹ РµРјСѓ РїРѕРєР°Р¶РµРј РІ РїРµСЂРІС‹Р№ СЂР°Р·

        sessionStorage[user_id] = {
            'suggests': [
                "РќРµ С…РѕС‡Сѓ.",
                "РќРµ Р±СѓРґСѓ.",
                "РћС‚СЃС‚Р°РЅСЊ!",
            ]
        }
        # Р—Р°РїРѕР»РЅСЏРµРј С‚РµРєСЃС‚ РѕС‚РІРµС‚Р°
        res['response']['text'] = 'РџСЂРёРІРµС‚! РљСѓРїРё СЃР»РѕРЅР°!'
        # РџРѕР»СѓС‡РёРј РїРѕРґСЃРєР°Р·РєРё
        res['response']['buttons'] = get_suggests(user_id)
        return

    # РЎСЋРґР° РґРѕР№РґРµРј С‚РѕР»СЊРєРѕ, РµСЃР»Рё РїРѕР»СЊР·РѕРІР°С‚РµР»СЊ РЅРµ РЅРѕРІС‹Р№, Рё СЂР°Р·РіРѕРІРѕСЂ СЃ РђР»РёСЃРѕР№ СѓР¶Рµ Р±С‹Р» РЅР°С‡Р°С‚
    # РћР±СЂР°Р±Р°С‚С‹РІР°РµРј РѕС‚РІРµС‚ РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ.
    # Р’ req['request']['original_utterance'] Р»РµР¶РёС‚ РІРµСЃСЊ С‚РµРєСЃС‚, С‡С‚Рѕ РЅР°Рј РїСЂРёСЃР»Р°Р» РїРѕР»СЊР·РѕРІР°С‚РµР»СЊ
    # Р•СЃР»Рё РѕРЅ РЅР°РїРёСЃР°Р» 'Р»Р°РґРЅРѕ', 'РєСѓРїР»СЋ', 'РїРѕРєСѓРїР°СЋ', 'С…РѕСЂРѕС€Рѕ', С‚Рѕ РјС‹ СЃС‡РёС‚Р°РµРј, С‡С‚Рѕ РїРѕР»СЊР·РѕРІР°С‚РµР»СЊ РЅРµ СЃРѕРіР»Р°СЃРёР»СЃСЏ.
    # РџРѕРґСѓРјР°Р№С‚Рµ, РІСЃРµ Р»Рё РІ СЌС‚РѕРј С„СЂР°РіРјРµРЅС‚Рµ РЅР°РїРёСЃР°РЅРѕ "РєСЂР°СЃРёРІРѕ"?
    if req['request']['original_utterance'].lower() in [
        'Р»Р°РґРЅРѕ',
        'РєСѓРїР»СЋ',
        'РїРѕРєСѓРїР°СЋ',
        'С…РѕСЂРѕС€Рѕ'
    ]:
        # РџРѕР»СЊР·РѕРІР°С‚РµР»СЊ СЃРѕРіР»Р°СЃРёР»СЃСЏ, РїСЂРѕС‰Р°РµРјСЃСЏ.
        res['response']['text'] = 'РЎР»РѕРЅР° РјРѕР¶РЅРѕ РЅР°Р№С‚Рё РЅР° РЇРЅРґРµРєСЃ.РњР°СЂРєРµС‚Рµ!'
        res['response']['end_session'] = True
        return

    # Р•СЃР»Рё РЅРµС‚, С‚Рѕ СѓР±РµР¶РґР°РµРј РµРіРѕ РєСѓРїРёС‚СЊ СЃР»РѕРЅР°!
    res['response']['text'] = 'Р’СЃРµ РіРѕРІРѕСЂСЏС‚ "%s", Р° С‚С‹ РєСѓРїРё СЃР»РѕРЅР°!' % (
        req['request']['original_utterance']
    )
    res['response']['buttons'] = get_suggests(user_id)


# Р¤СѓРЅРєС†РёСЏ РІРѕР·РІСЂР°С‰Р°РµС‚ РґРІРµ РїРѕРґСЃРєР°Р·РєРё РґР»СЏ РѕС‚РІРµС‚Р°.
def get_suggests(user_id):
    session = sessionStorage[user_id]

    # Р’С‹Р±РёСЂР°РµРј РґРІРµ РїРµСЂРІС‹Рµ РїРѕРґСЃРєР°Р·РєРё РёР· РјР°СЃСЃРёРІР°.
    suggests = [
        {'title': suggest, 'hide': True}
        for suggest in session['suggests'][:2]
    ]

    # РЈР±РёСЂР°РµРј РїРµСЂРІСѓСЋ РїРѕРґСЃРєР°Р·РєСѓ, С‡С‚РѕР±С‹ РїРѕРґСЃРєР°Р·РєРё РјРµРЅСЏР»РёСЃСЊ РєР°Р¶РґС‹Р№ СЂР°Р·.
    session['suggests'] = session['suggests'][1:]
    sessionStorage[user_id] = session

    # Р•СЃР»Рё РѕСЃС‚Р°Р»Р°СЃСЊ С‚РѕР»СЊРєРѕ РѕРґРЅР° РїРѕРґСЃРєР°Р·РєР°, РїСЂРµРґР»Р°РіР°РµРј РїРѕРґСЃРєР°Р·РєСѓ
    # СЃРѕ СЃСЃС‹Р»РєРѕР№ РЅР° РЇРЅРґРµРєСЃ.РњР°СЂРєРµС‚.
    if len(suggests) < 2:
        suggests.append({
            "title": "Р›Р°РґРЅРѕ",
            "url": "https://market.yandex.ru/search?text=СЃР»РѕРЅ",
            "hide": True
        })

    return suggests


if __name__ == '__main__':
    app.run()